[Survived] BlockStatement
default/lwc/sampleComponent/sampleComponent.js:8:25
 export default class SampleComponent extends LightningElement {
     result;
 
-    connectedCallback() {
-        someApexMethod()
-            .then(result => this.result = result);
-    }
+    connectedCallback() {}
 }

[Survived] ArrowFunction
default/lwc/sampleComponent/sampleComponent.js:10:19
 
     connectedCallback() {
         someApexMethod()
-            .then(result => this.result = result);
+            .then(() => undefined);
     }
 }
