[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:11:38
 const SUCCESS_STATUS = 200;
 const UNKNOWN = 'unknown';
 
-const isJsonString = (jsonString) => {
-    try {
-        const o = JSON.parse(jsonString);
-        if (o && typeof o === "object") {
-            return true;
-        }
-    }
-    catch (e) {
-        // returning false
-    }
-    return false;
-};
+const isJsonString = (jsonString) => {};
 
 const parseJSON = (jsonString) => {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:12:9
 const UNKNOWN = 'unknown';
 
 const isJsonString = (jsonString) => {
-    try {
-        const o = JSON.parse(jsonString);
-        if (o && typeof o === "object") {
-            return true;
-        }
-    }
+    try {}
     catch (e) {
         // returning false
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:14:13
 const isJsonString = (jsonString) => {
     try {
         const o = JSON.parse(jsonString);
-        if (o && typeof o === "object") {
+        if (false) {
             return true;
         }
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
default/lwc/ha4cPKCE/ha4cPKCE.js:14:18
 const isJsonString = (jsonString) => {
     try {
         const o = JSON.parse(jsonString);
-        if (o && typeof o === "object") {
+        if (o && typeof o !== "object") {
             return true;
         }
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:15:20
     try {
         const o = JSON.parse(jsonString);
         if (o && typeof o === "object") {
-            return true;
+            return false;
         }
     }
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:24:35
     return false;
 };
 
-const parseJSON = (jsonString) => {
-    if (isJsonString(jsonString)) {
-        return JSON.parse(jsonString);
-    }
-    return {};
-};
+const parseJSON = (jsonString) => {};
 
 export default class HA4CPkce extends NavigationMixin(LightningElement) {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and no deviceId
statusReason: TypeError: Cannot read properties of undefined (reading 'ha4cVfReady')

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:25:9
 };
 
 const parseJSON = (jsonString) => {
-    if (isJsonString(jsonString)) {
+    if (false) {
         return JSON.parse(jsonString);
     }
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:25:35
 };
 
 const parseJSON = (jsonString) => {
-    if (isJsonString(jsonString)) {
-        return JSON.parse(jsonString);
-    }
+    if (isJsonString(jsonString)) {}
     return {};
 };
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:35:30
 
     loadFrame;
     WORKSTATION = 'ha4c_workstation_id';
-    calledRenderedCallback = false;
+    calledRenderedCallback = true;
     vfMessageListener;
     @api recordId;
killedBy: c-ha4c-p-k-c-e test publish call not made when workstationId not present from session storage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:49:25
         this.vfMessageListener = this.handleAuthResponse.bind(this);
     }
 
-    connectedCallback() {
-        //bind event listener for data received from visualforce auth call 
-        window.addEventListener('message', this.vfMessageListener);
-
-
-    }
+    connectedCallback() {}
 
     disconnectedCallback() {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:56:28
 
     }
 
-    disconnectedCallback() {
-        window.removeEventListener('message', this.vfMessageListener);
-    }
+    disconnectedCallback() {}
 
     renderedCallback() {
killedBy: c-ha4c-p-k-c-e test message event listener when vf page is ready
statusReason: TypeError: Cannot read properties of null (reading '_origin')

[Killed] StringLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:57:36
     }
 
     disconnectedCallback() {
-        window.removeEventListener('message', this.vfMessageListener);
+        window.removeEventListener("", this.vfMessageListener);
     }
 
killedBy: c-ha4c-p-k-c-e test message event listener when vf page is ready
statusReason: TypeError: Cannot read properties of null (reading '_origin')

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:60:24
         window.removeEventListener('message', this.vfMessageListener);
     }
 
-    renderedCallback() {
-        if (!this.calledRenderedCallback) {
-            this.calledRenderedCallback = true;
-            const workstationId = sessionStorage.getItem(this.WORKSTATION);
-            if (workstationId) {
-                this.navigateToWeb(workstationId);
-            } else {
-                this.loadFrame = true;
-            }
-        }
-    }
+    renderedCallback() {}
 
     async handleAuthResponse(event) {
killedBy: c-ha4c-p-k-c-e test publish call not made when workstationId not present from session storage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:61:13
     }
 
     renderedCallback() {
-        if (!this.calledRenderedCallback) {
+        if (this.calledRenderedCallback) {
             this.calledRenderedCallback = true;
             const workstationId = sessionStorage.getItem(this.WORKSTATION);
killedBy: c-ha4c-p-k-c-e test publish call not made when workstationId not present from session storage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:61:43
     }
 
     renderedCallback() {
-        if (!this.calledRenderedCallback) {
-            this.calledRenderedCallback = true;
-            const workstationId = sessionStorage.getItem(this.WORKSTATION);
-            if (workstationId) {
-                this.navigateToWeb(workstationId);
-            } else {
-                this.loadFrame = true;
-            }
-        }
+        if (!this.calledRenderedCallback) {}
     }
 
killedBy: c-ha4c-p-k-c-e test publish call not made when workstationId not present from session storage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] BooleanLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:62:43
 
     renderedCallback() {
         if (!this.calledRenderedCallback) {
-            this.calledRenderedCallback = true;
+            this.calledRenderedCallback = false;
             const workstationId = sessionStorage.getItem(this.WORKSTATION);
             if (workstationId) {

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:64:32
         if (!this.calledRenderedCallback) {
             this.calledRenderedCallback = true;
             const workstationId = sessionStorage.getItem(this.WORKSTATION);
-            if (workstationId) {
-                this.navigateToWeb(workstationId);
-            } else {
+            if (workstationId) {} else {
                 this.loadFrame = true;
             }
killedBy: c-ha4c-p-k-c-e make sure removeEventListener fires and rendered callback happens only once
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "https://necholauncher-v1-env3.app-71a.opr.test.statefarm.org/nechoLauncher/launchHA4C?selPolicy=0010455&selPolOpt=6&lob=A&caseID=5001b00000CIMg2AAH&associateID=VLGVS5ZW9AK&clientID=HFQ629WX7WA&workstationID=WPWFZRNF&pgmName=PCA21&callingApp=Case"
Received: "undefined&workstationID=unknown&pgmName=PCA21&callingApp=Case"

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:64:17
         if (!this.calledRenderedCallback) {
             this.calledRenderedCallback = true;
             const workstationId = sessionStorage.getItem(this.WORKSTATION);
-            if (workstationId) {
+            if (false) {
                 this.navigateToWeb(workstationId);
             } else {
killedBy: c-ha4c-p-k-c-e test calls publish based on workstation Id from session storage
statusReason: Error: expect(received).toBeNull()

Received: <iframe class="slds-hide" height="0" sandbox="allow-modals allow-same-origin allow-scripts allow-popups allow-popups-to-escape-sandbox" src="/apex/HA4CPKCE" title="iframe" width="100%" />

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:66:20
             const workstationId = sessionStorage.getItem(this.WORKSTATION);
             if (workstationId) {
                 this.navigateToWeb(workstationId);
-            } else {
-                this.loadFrame = true;
-            }
+            } else {}
         }
     }
killedBy: c-ha4c-p-k-c-e test publish call not made when workstationId not present from session storage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:67:34
             if (workstationId) {
                 this.navigateToWeb(workstationId);
             } else {
-                this.loadFrame = true;
+                this.loadFrame = false;
             }
         }
killedBy: c-ha4c-p-k-c-e test publish call not made when workstationId not present from session storage
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:72:37
         }
     }
 
-    async handleAuthResponse(event) {
-        const vfOrigin = await getVFOrigin();
-        if (event.data && (event.origin === vfOrigin)) {
-            const msg = parseJSON(event.data);
-            if (msg.ha4cVfReady === true) {
-                this.initiateVFAuthCall(vfOrigin);
-            }
-            if (msg.ha4cToken === true) {
-                await this.processToken();
-            }
-            if (msg.ha4cToken === false) {
-                this.processWorkstationId(UNKNOWN);
-            }
-        }
-    }
+    async handleAuthResponse(event) {}
 
     initiateVFAuthCall(vfOrigin) {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
default/lwc/ha4cPKCE/ha4cPKCE.js:74:13
 
     async handleAuthResponse(event) {
         const vfOrigin = await getVFOrigin();
-        if (event.data && (event.origin === vfOrigin)) {
+        if (event.data || event.origin === vfOrigin) {
             const msg = parseJSON(event.data);
             if (msg.ha4cVfReady === true) {
killedBy: c-ha4c-p-k-c-e origins do not match
statusReason: SyntaxError: Failed to execute 'postMessage' on 'Window': Invalid target origin '' in a call to 'postMessage'.

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:74:13
 
     async handleAuthResponse(event) {
         const vfOrigin = await getVFOrigin();
-        if (event.data && (event.origin === vfOrigin)) {
+        if (false) {
             const msg = parseJSON(event.data);
             if (msg.ha4cVfReady === true) {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:76:17
         const vfOrigin = await getVFOrigin();
         if (event.data && (event.origin === vfOrigin)) {
             const msg = parseJSON(event.data);
-            if (msg.ha4cVfReady === true) {
+            if (false) {
                 this.initiateVFAuthCall(vfOrigin);
             }
killedBy: c-ha4c-p-k-c-e test message event listener when vf page is ready
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"ha4cPkceLogin\":true}", "https://statefarm--pdnndforce--c.visualforce.com"

Number of calls: 0

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:76:43
         const vfOrigin = await getVFOrigin();
         if (event.data && (event.origin === vfOrigin)) {
             const msg = parseJSON(event.data);
-            if (msg.ha4cVfReady === true) {
-                this.initiateVFAuthCall(vfOrigin);
-            }
+            if (msg.ha4cVfReady === true) {}
             if (msg.ha4cToken === true) {
                 await this.processToken();
killedBy: c-ha4c-p-k-c-e test message event listener when vf page is ready
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"ha4cPkceLogin\":true}", "https://statefarm--pdnndforce--c.visualforce.com"

Number of calls: 0

[Killed] EqualityOperator
default/lwc/ha4cPKCE/ha4cPKCE.js:79:17
             if (msg.ha4cVfReady === true) {
                 this.initiateVFAuthCall(vfOrigin);
             }
-            if (msg.ha4cToken === true) {
+            if (msg.ha4cToken !== true) {
                 await this.processToken();
             }
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:79:17
             if (msg.ha4cVfReady === true) {
                 this.initiateVFAuthCall(vfOrigin);
             }
-            if (msg.ha4cToken === true) {
+            if (true) {
                 await this.processToken();
             }
killedBy: c-ha4c-p-k-c-e test handleAuthResponse without message data
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:82:42
             if (msg.ha4cToken === true) {
                 await this.processToken();
             }
-            if (msg.ha4cToken === false) {
-                this.processWorkstationId(UNKNOWN);
-            }
+            if (msg.ha4cToken === false) {}
         }
     }
killedBy: c-ha4c-p-k-c-e test navigateToWeb success
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
default/lwc/ha4cPKCE/ha4cPKCE.js:82:17
             if (msg.ha4cToken === true) {
                 await this.processToken();
             }
-            if (msg.ha4cToken === false) {
+            if (msg.ha4cToken !== false) {
                 this.processWorkstationId(UNKNOWN);
             }
killedBy: c-ha4c-p-k-c-e validates fetch endpoint and options
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WPWFZRNF"
Received: "unknown"

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:88:34
         }
     }
 
-    initiateVFAuthCall(vfOrigin) {
-        //call vf to initiate auth flow
-        const message = { ha4cPkceLogin: true }
-        this.template.querySelector('iframe').contentWindow.postMessage(JSON.stringify(message), vfOrigin);
-    }
+    initiateVFAuthCall(vfOrigin) {}
 
     async processToken() {
killedBy: c-ha4c-p-k-c-e test message event listener when vf page is ready
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"ha4cPkceLogin\":true}", "https://statefarm--pdnndforce--c.visualforce.com"

Number of calls: 0

[Killed] BooleanLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:90:42
 
     initiateVFAuthCall(vfOrigin) {
         //call vf to initiate auth flow
-        const message = { ha4cPkceLogin: true }
+        const message = { ha4cPkceLogin: false }
         this.template.querySelector('iframe').contentWindow.postMessage(JSON.stringify(message), vfOrigin);
     }
killedBy: c-ha4c-p-k-c-e test message event listener when vf page is ready
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "{\"ha4cPkceLogin\":true}", "https://statefarm--pdnndforce--c.visualforce.com"
Received: "{\"ha4cPkceLogin\":false}", "https://statefarm--pdnndforce--c.visualforce.com"

Number of calls: 1

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:94:26
         this.template.querySelector('iframe').contentWindow.postMessage(JSON.stringify(message), vfOrigin);
     }
 
-    async processToken() {
-        const token = await getHA4CToken();
-        const deviceId = parseJSON(window.atob(token.split('.')[1])).deviceid;
-        const workstationId = await this.determineWorkstationId(token, deviceId);
-        this.processWorkstationId(workstationId);
-    }
+    async processToken() {}
 
     async determineWorkstationId(token, deviceId) {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:101:51
         this.processWorkstationId(workstationId);
     }
 
-    async determineWorkstationId(token, deviceId) {
-        // call microsoftGraph API if the deviceId is not undefined
-        if (typeof deviceId != 'undefined') {
-            const endpoint = `https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'${deviceId}'&$select=displayName`;
-            const respJson = await this.callMSGraph(endpoint, token);
-            return respJson?.value[0]?.displayName || UNKNOWN;
-        }
-        return UNKNOWN
-    }
+    async determineWorkstationId(token, deviceId) {}
 
     processWorkstationId(workstationId) {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
default/lwc/ha4cPKCE/ha4cPKCE.js:103:13
 
     async determineWorkstationId(token, deviceId) {
         // call microsoftGraph API if the deviceId is not undefined
-        if (typeof deviceId != 'undefined') {
+        if (typeof deviceId == 'undefined') {
             const endpoint = `https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'${deviceId}'&$select=displayName`;
             const respJson = await this.callMSGraph(endpoint, token);
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and no deviceId
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:103:13
 
     async determineWorkstationId(token, deviceId) {
         // call microsoftGraph API if the deviceId is not undefined
-        if (typeof deviceId != 'undefined') {
+        if (true) {
             const endpoint = `https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'${deviceId}'&$select=displayName`;
             const respJson = await this.callMSGraph(endpoint, token);
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and no deviceId
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] StringLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:104:30
     async determineWorkstationId(token, deviceId) {
         // call microsoftGraph API if the deviceId is not undefined
         if (typeof deviceId != 'undefined') {
-            const endpoint = `https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'${deviceId}'&$select=displayName`;
+            const endpoint = ``;
             const respJson = await this.callMSGraph(endpoint, token);
             return respJson?.value[0]?.displayName || UNKNOWN;
killedBy: c-ha4c-p-k-c-e validates fetch endpoint and options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'5485eba1-1254-4379-8fb9-c8819db8a023'&$select=displayName",
+ "",

[Killed] LogicalOperator
default/lwc/ha4cPKCE/ha4cPKCE.js:106:20
         if (typeof deviceId != 'undefined') {
             const endpoint = `https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'${deviceId}'&$select=displayName`;
             const respJson = await this.callMSGraph(endpoint, token);
-            return respJson?.value[0]?.displayName || UNKNOWN;
+            return respJson?.value[0]?.displayName && UNKNOWN;
         }
         return UNKNOWN
killedBy: c-ha4c-p-k-c-e test should fail when displayName not present in resposne of callMSGraph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unknown"
Received: "undefined"

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:106:20
         if (typeof deviceId != 'undefined') {
             const endpoint = `https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'${deviceId}'&$select=displayName`;
             const respJson = await this.callMSGraph(endpoint, token);
-            return respJson?.value[0]?.displayName || UNKNOWN;
+            return true;
         }
         return UNKNOWN
killedBy: c-ha4c-p-k-c-e test should fail when displayName not present in resposne of callMSGraph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unknown"
Received: "true"

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:111:41
         return UNKNOWN
     }
 
-    processWorkstationId(workstationId) {
-        sessionStorage.setItem(this.WORKSTATION, workstationId);
-        this.navigateToWeb(workstationId);
-
-    }
+    processWorkstationId(workstationId) {}
 
     //This method will launch URL in new Browser Window tab after setting up all paramters
killedBy: c-ha4c-p-k-c-e test should fail when displayName not present in resposne of callMSGraph
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "unknown"
Received: null

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:118:40
     }
 
     //This method will launch URL in new Browser Window tab after setting up all paramters
-    async navigateToWeb(workstationId) {
-        try {
-            if (this.parmString === undefined) {
-                this.parmString = await getPolicyDetailsParmHA4C({ caseId: this.recordId });
-            }
-            this[NavigationMixin.Navigate]({
-                type: 'standard__webPage',
-                attributes: {
-                    url: this.parmString + '&workstationID=' + workstationId + '&pgmName=PCA21&callingApp=Case'
-                }
-            })
-        } catch (error) {
-            this.showToast('Launch to Necho Status', "Error", 'The operation couldnt be completed (Status: ' +
-                error.message +
-                ' ). Please contact WG11255.');
-        }
-    }
+    async navigateToWeb(workstationId) {}
 
     async callMSGraph(endpoint, accessToken) {
killedBy: c-ha4c-p-k-c-e make sure removeEventListener fires and rendered callback happens only once
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:119:13
 
     //This method will launch URL in new Browser Window tab after setting up all paramters
     async navigateToWeb(workstationId) {
-        try {
-            if (this.parmString === undefined) {
-                this.parmString = await getPolicyDetailsParmHA4C({ caseId: this.recordId });
-            }
-            this[NavigationMixin.Navigate]({
-                type: 'standard__webPage',
-                attributes: {
-                    url: this.parmString + '&workstationID=' + workstationId + '&pgmName=PCA21&callingApp=Case'
-                }
-            })
-        } catch (error) {
+        try {} catch (error) {
             this.showToast('Launch to Necho Status', "Error", 'The operation couldnt be completed (Status: ' +
                 error.message +
killedBy: c-ha4c-p-k-c-e make sure removeEventListener fires and rendered callback happens only once
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:120:48
     //This method will launch URL in new Browser Window tab after setting up all paramters
     async navigateToWeb(workstationId) {
         try {
-            if (this.parmString === undefined) {
-                this.parmString = await getPolicyDetailsParmHA4C({ caseId: this.recordId });
-            }
+            if (this.parmString === undefined) {}
             this[NavigationMixin.Navigate]({
                 type: 'standard__webPage',
killedBy: c-ha4c-p-k-c-e make sure removeEventListener fires and rendered callback happens only once
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "https://necholauncher-v1-env3.app-71a.opr.test.statefarm.org/nechoLauncher/launchHA4C?selPolicy=0010455&selPolOpt=6&lob=A&caseID=5001b00000CIMg2AAH&associateID=VLGVS5ZW9AK&clientID=HFQ629WX7WA&workstationID=WPWFZRNF&pgmName=PCA21&callingApp=Case"
Received: "undefined&workstationID=WPWFZRNF&pgmName=PCA21&callingApp=Case"

[Killed] ConditionalExpression
default/lwc/ha4cPKCE/ha4cPKCE.js:120:17
     //This method will launch URL in new Browser Window tab after setting up all paramters
     async navigateToWeb(workstationId) {
         try {
-            if (this.parmString === undefined) {
+            if (false) {
                 this.parmString = await getPolicyDetailsParmHA4C({ caseId: this.recordId });
             }
killedBy: c-ha4c-p-k-c-e make sure removeEventListener fires and rendered callback happens only once
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "https://necholauncher-v1-env3.app-71a.opr.test.statefarm.org/nechoLauncher/launchHA4C?selPolicy=0010455&selPolOpt=6&lob=A&caseID=5001b00000CIMg2AAH&associateID=VLGVS5ZW9AK&clientID=HFQ629WX7WA&workstationID=WPWFZRNF&pgmName=PCA21&callingApp=Case"
Received: "undefined&workstationID=WPWFZRNF&pgmName=PCA21&callingApp=Case"

[Killed] StringLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:126:44
             this[NavigationMixin.Navigate]({
                 type: 'standard__webPage',
                 attributes: {
-                    url: this.parmString + '&workstationID=' + workstationId + '&pgmName=PCA21&callingApp=Case'
+                    url: this.parmString + "" + workstationId + '&pgmName=PCA21&callingApp=Case'
                 }
             })
killedBy: c-ha4c-p-k-c-e make sure removeEventListener fires and rendered callback happens only once
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "https://necholauncher-v1-env3.app-71a.opr.test.statefarm.org/nechoLauncher/launchHA4C?selPolicy=0010455&selPolOpt=6&lob=A&caseID=5001b00000CIMg2AAH&associateID=VLGVS5ZW9AK&clientID=HFQ629WX7WA&workstationID=WPWFZRNF&pgmName=PCA21&callingApp=Case"
Received: "https://necholauncher-v1-env3.app-71a.opr.test.statefarm.org/nechoLaunc

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:129:25
                     url: this.parmString + '&workstationID=' + workstationId + '&pgmName=PCA21&callingApp=Case'
                 }
             })
-        } catch (error) {
-            this.showToast('Launch to Necho Status', "Error", 'The operation couldnt be completed (Status: ' +
-                error.message +
-                ' ). Please contact WG11255.');
-        }
+        } catch (error) {}
     }
 
killedBy: c-ha4c-p-k-c-e test navigateToWeb error
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:130:63
                 }
             })
         } catch (error) {
-            this.showToast('Launch to Necho Status', "Error", 'The operation couldnt be completed (Status: ' +
+            this.showToast('Launch to Necho Status', "Error", "" +
                 error.message +
                 ' ). Please contact WG11255.');
killedBy: c-ha4c-p-k-c-e test navigateToWeb error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The operation couldnt be completed (Status: undefined ). Please contact WG11255."
Received: "undefined ). Please contact WG11255."
