[Killed] StringLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:130:28
                 }
             })
         } catch (error) {
-            this.showToast('Launch to Necho Status', "Error", 'The operation couldnt be completed (Status: ' +
+            this.showToast("", "Error", 'The operation couldnt be completed (Status: ' +
                 error.message +
                 ' ). Please contact WG11255.');
killedBy: c-ha4c-p-k-c-e test navigateToWeb error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Launch to Necho Status"
Received: ""

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:136:46
         }
     }
 
-    async callMSGraph(endpoint, accessToken) {
-        const bearer = `Bearer ${accessToken}`;
-        const options = {
-            method: "GET",
-            headers: {
-                'Authorization': bearer,
-                'Content-Type': 'application/json',
-                'Accept': 'application/json',
-                'ConsistencyLevel': 'eventual'
-            }
-        };
-        try {
-            const response = await fetch(endpoint, options);
-            // return response json only if the status code is 200
-            if (response.status === SUCCESS_STATUS) {
-                const responseBody = await response.json();
-                return responseBody;
-            }
-        } catch (e) {
-            // nothing to do here - just returning null
-        }
-        return null;
-    }
+    async callMSGraph(endpoint, accessToken) {}
 
     showToast(title, type, message) {
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:138:25
 
     async callMSGraph(endpoint, accessToken) {
         const bearer = `Bearer ${accessToken}`;
-        const options = {
-            method: "GET",
-            headers: {
-                'Authorization': bearer,
-                'Content-Type': 'application/json',
-                'Accept': 'application/json',
-                'ConsistencyLevel': 'eventual'
-            }
-        };
+        const options = {};
         try {
             const response = await fetch(endpoint, options);
killedBy: c-ha4c-p-k-c-e validates fetch endpoint and options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'5485eba1-1254-4379-8fb9-c8819db8a023'&$select=displayName",
- Object {
-   "headers": Object {

[Killed] ObjectLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:140:22
         const bearer = `Bearer ${accessToken}`;
         const options = {
             method: "GET",
-            headers: {
-                'Authorization': bearer,
-                'Content-Type': 'application/json',
-                'Accept': 'application/json',
-                'ConsistencyLevel': 'eventual'
-            }
+            headers: {}
         };
         try {
killedBy: c-ha4c-p-k-c-e validates fetch endpoint and options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'5485eba1-1254-4379-8fb9-c8819db8a023'&$select=displayName",
  Object {
-   "headers": Object {

[Killed] StringLiteral
default/lwc/ha4cPKCE/ha4cPKCE.js:144:37
                 'Authorization': bearer,
                 'Content-Type': 'application/json',
                 'Accept': 'application/json',
-                'ConsistencyLevel': 'eventual'
+                'ConsistencyLevel': ""
             }
         };
killedBy: c-ha4c-p-k-c-e validates fetch endpoint and options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "https://graph.microsoft.com/v1.0/devices?$filter=deviceId+eq+'5485eba1-1254-4379-8fb9-c8819db8a023'&$select=displayName",
  Object {
    "headers": Object {

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:147:13
                 'ConsistencyLevel': 'eventual'
             }
         };
-        try {
-            const response = await fetch(endpoint, options);
-            // return response json only if the status code is 200
-            if (response.status === SUCCESS_STATUS) {
-                const responseBody = await response.json();
-                return responseBody;
-            }
-        } catch (e) {
+        try {} catch (e) {
             // nothing to do here - just returning null
         }
killedBy: c-ha4c-p-k-c-e test lookUpWorkstationId with access token and deviceId
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:150:53
         try {
             const response = await fetch(endpoint, options);
             // return response json only if the status code is 200
-            if (response.status === SUCCESS_STATUS) {
-                const responseBody = await response.json();
-                return responseBody;
-            }
+            if (response.status === SUCCESS_STATUS) {}
         } catch (e) {
             // nothing to do here - just returning null
killedBy: c-ha4c-p-k-c-e validates fetch endpoint and options
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WPWFZRNF"
Received: "unknown"

[Killed] EqualityOperator
default/lwc/ha4cPKCE/ha4cPKCE.js:150:17
         try {
             const response = await fetch(endpoint, options);
             // return response json only if the status code is 200
-            if (response.status === SUCCESS_STATUS) {
+            if (response.status !== SUCCESS_STATUS) {
                 const responseBody = await response.json();
                 return responseBody;
killedBy: c-ha4c-p-k-c-e validates fetch endpoint and options
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WPWFZRNF"
Received: "unknown"

[Killed] BlockStatement
default/lwc/ha4cPKCE/ha4cPKCE.js:160:37
         return null;
     }
 
-    showToast(title, type, message) {
-        const toastEvent = new ShowToastEvent({
-            title: title,
-            variant: type,
-            message: message
-        });
-        this.dispatchEvent(toastEvent);
-    }
+    showToast(title, type, message) {}
 }
killedBy: c-ha4c-p-k-c-e test navigateToWeb error
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
